In [3]:
%matplotlib inline
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt

### Iris Data Set

In [5]:
sns.get_dataset_names()

/usr/local/anaconda3/lib/python3.7/site-packages/seaborn/utils.py:376: UserWarning: No parser was explicitly specified, so I'm using the best available HTML parser for this system ("lxml"). This usually isn't a problem, but if you run this code on another system, or in a different virtual environment, it may use a different parser and behave differently.

The code that caused this warning is on line 376 of the file /usr/local/anaconda3/lib/python3.7/site-packages/seaborn/utils.py. To get rid of this warning, pass the additional argument 'features="lxml"' to the BeautifulSoup constructor.

  gh_list = BeautifulSoup(http)

['anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'iris',
 'mpg',
 'planets',
 'tips',
 'titanic']

In [10]:
df_iris = sns.load_dataset('iris')
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [12]:
df_iris.shape

(150, 5)

In [13]:
df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [14]:
df_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [15]:
df_iris.describe()
# rescaling not necessary

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### Excel stats

In [27]:
df_excel = pd.read_excel('/Users/MatthewZapata/Excel/Matthew Zapata - Excel_Stats.xlsx', sheet_name='Data')
df_excel_sample = df_excel.head(100)

In [28]:
df_excel.shape[0]

7043

In [29]:
df_excel.columns[:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [31]:
df_excel.select_dtypes('object').columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [33]:
cols_range = df_excel.describe().columns
desc = df_excel.describe()

In [34]:
desc

,is_senior_citizen,tenure,phone_service,internet_service,contract_type,monthly_charges,total_charges
count,7043.000000,7043.000000,7043.000000,7043.000000,7043.000000,7043.000000,7032.000000
mean,0.162147,32.371149,1.325004,1.222916,0.690473,64.761692,2283.300441
std,0.368612,24.559481,0.642730,0.778877,0.833755,30.090047,2266.771362
min,0.000000,0.000000,0.000000,0.000000,0.000000,18.250000,18.800000
25%,0.000000,9.000000,1.000000,1.000000,0.000000,35.500000,401.450000
50%,0.000000,29.000000,1.000000,1.000000,0.000000,70.350000,1397.475000
75%,0.000000,55.000000,2.000000,2.000000,1.000000,89.850000,3794.737500
max,1.000000,72.000000,2.000000,2.000000,2.000000,118.750000,8684.800000

In [37]:
for col in cols_range:
    print(f'The range of {col} is: {desc[col][7] - desc[col][3]}')

The range of is_senior_citizen is: 1.0
The range of tenure is: 72.0
The range of phone_service is: 2.0
The range of internet_service is: 2.0
The range of contract_type is: 2.0
The range of monthly_charges is: 100.5
The range of total_charges is: 8666.0

### Google slides

In [44]:
df_google = pd.read_clipboard('/t')
df_google.head(3)

,rowid,date,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
0,1,2015-02-04 17:51:00,23.18,27.2720,426.0,721.25,0.004793,1
1,2,2015-02-04 17:51:59,23.15,27.2675,429.5,714.00,0.004783,1
2,3,2015-02-04 17:53:00,23.15,27.2450,426.0,713.50,0.004779,1

In [46]:
df_google.shape

(8143, 8)

In [47]:
df_google.columns

Index(['rowid', 'date', 'Temperature', 'Humidity', 'Light', 'CO2',
       'HumidityRatio', 'Occupancy'],
      dtype='object')

In [48]:
df_google.dtypes

rowid              int64
date              object
Temperature      float64
Humidity         float64
Light            float64
CO2              float64
HumidityRatio    float64
Occupancy          int64
dtype: object

In [49]:
df_google.describe()

,rowid,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
count,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000
mean,4072.000000,20.619084,25.731507,119.519375,606.546243,0.003863,0.212330
std,2350.825954,1.016916,5.531211,194.755805,314.320877,0.000852,0.408982
min,1.000000,19.000000,16.745000,0.000000,412.750000,0.002674,0.000000
25%,2036.500000,19.700000,20.200000,0.000000,439.000000,0.003078,0.000000
50%,4072.000000,20.390000,26.222500,0.000000,453.500000,0.003801,0.000000
75%,6107.500000,21.390000,30.533333,256.375000,638.833333,0.004352,0.000000
max,8143.000000,23.180000,39.117500,1546.333333,2028.500000,0.006476,1.000000

In [50]:
df_google.date.unique()

array(['2015-02-04 17:51:00', '2015-02-04 17:51:59',
       '2015-02-04 17:53:00', ..., '2015-02-10 9:30:59',
       '2015-02-10 9:32:00', '2015-02-10 9:33:00'], dtype=object)

### SQL Titanic

In [52]:
from env import get_connection, password, host, user

In [56]:
dbc = get_connection('titanic_db')

Use this as dbc to help get your SQL data: Engine(mysql+pymysql://ada_665:***@157.230.209.171/titanic_db)

In [ ]:
df_csv = pd.read_sql('SELECT * FROM passengers', dbc)

In [58]:
df_csv.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [59]:
df_csv.tail()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
886,886,0,2,male,27.0,0,0,13.00,S,Second,None,Southampton,1
887,887,1,1,female,19.0,0,0,30.00,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.45,S,Third,None,Southampton,0
889,889,1,1,male,26.0,0,0,30.00,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.75,Q,Third,None,Queenstown,1

In [61]:
df_csv.shape

(891, 13)

In [62]:
df_csv.columns

Index(['passenger_id', 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch',
       'fare', 'embarked', 'class', 'deck', 'embark_town', 'alone'],
      dtype='object')

In [63]:
df_csv.dtypes

passenger_id      int64
survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class            object
deck             object
embark_town      object
alone             int64
dtype: object

In [64]:
df_csv.describe()

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,445.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,0.602694
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,0.489615
min,0.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,222.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,445.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,1.000000
75%,667.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,890.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

In [68]:
col_obj = df_csv.select_dtypes('object').columns
obj = df_csv.select_dtypes('object')

In [82]:
col_obj

Index(['sex', 'embarked', 'class', 'deck', 'embark_town'], dtype='object')

In [106]:
for col in col_obj:
    print(obj.groupby(col)[col].agg('count').sort_values(ascending=False))

sex
male      577
female    314
Name: sex, dtype: int64
embarked
S    644
C    168
Q     77
Name: embarked, dtype: int64
class
Third     491
First     216
Second    184
Name: class, dtype: int64
deck
C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64
embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [90]:
obj.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
sex            891 non-null object
embarked       889 non-null object
class          891 non-null object
deck           203 non-null object
embark_town    889 non-null object
dtypes: object(5)
memory usage: 34.9+ KB